In [2]:
%load_ext sql
%sql sqlite://

'Connected: @None'

In [3]:
%%sql

create table dogs as
    select "abraham" as name, "long" as fur union
    select "barack", "short" union
    select "clinton", "long" union
    select "delano", "long" union
    select "eisenhower", "short" union
    select "fillmore", "curly" union
    select "grover", "short" union
    select "herbert", "curly";
    
create table parents as
    select "abraham" as parent, "barack" as child union
    select "abraham"          , "clinton"         union
    select "delano"          , "herbert"         union
    select "fillmore"          , "abraham"         union
    select "fillmore"          , "delano"         union
    select "fillmore"          , "grover"         union
    select "eisenhower"          , "fillmore";

 * sqlite://
Done.
Done.

[]

# Aliases and Dot Expressions

In the previous video, we assumed that each column name is unique across tables. This time, what if 2 different tables have the same column name?

## Joining a Table with Itself

Two tables may share a column name; dot expressions and aliases disambiguate column values.

Recall the structure of the select statement,

In [ ]:
select [column] from [table] where [condition] order by [order]

`[table]` is a comma-separated list of table names **with optional aliases**.

For example, if we want to select all pairs of siblings (children with the same parent), we do the following,

In [4]:
%%sql
select a.child as first, b.child as second
    from parents as a, parents as b
    where a.parent = b.parent and a.child < b.child;

 * sqlite://
Done.

[('barack', 'clinton'),
 ('abraham', 'delano'),
 ('abraham', 'grover'),
 ('delano', 'grover')]

In the following statement,

In [ ]:
from parents as a, parents as b

We are joining the `parents` table with itself. On top of that, we are giving them aliases: the first `parents` is `a`, the second `parents` is `b`.

In [16]:
%%sql
select a.child as first, b.child as second
    from parents as a, parents as b;

 * sqlite://
Done.

[('barack', 'barack'),
 ('barack', 'clinton'),
 ('barack', 'herbert'),
 ('barack', 'fillmore'),
 ('barack', 'abraham'),
 ('barack', 'delano'),
 ('barack', 'grover'),
 ('clinton', 'barack'),
 ('clinton', 'clinton'),
 ('clinton', 'herbert'),
 ('clinton', 'fillmore'),
 ('clinton', 'abraham'),
 ('clinton', 'delano'),
 ('clinton', 'grover'),
 ('herbert', 'barack'),
 ('herbert', 'clinton'),
 ('herbert', 'herbert'),
 ('herbert', 'fillmore'),
 ('herbert', 'abraham'),
 ('herbert', 'delano'),
 ('herbert', 'grover'),
 ('fillmore', 'barack'),
 ('fillmore', 'clinton'),
 ('fillmore', 'herbert'),
 ('fillmore', 'fillmore'),
 ('fillmore', 'abraham'),
 ('fillmore', 'delano'),
 ('fillmore', 'grover'),
 ('abraham', 'barack'),
 ('abraham', 'clinton'),
 ('abraham', 'herbert'),
 ('abraham', 'fillmore'),
 ('abraham', 'abraham'),
 ('abraham', 'delano'),
 ('abraham', 'grover'),
 ('delano', 'barack'),
 ('delano', 'clinton'),
 ('delano', 'herbert'),
 ('delano', 'fillmore'),
 ('delano', 'abraham'),
 ('delano', 'delano'),
 ('delano', 'grover'),
 ('grover', 'barack'),
 ('grover', 'clinton'),
 ('grover', 'herbert'),
 ('grover', 'fillmore'),
 ('grover', 'abraham'),
 ('grover', 'delano'),
 ('grover', 'grover')]

Above, we obtained all possible pairs of childs. However, we only want the possible pairs where the pairs' parent are the same. We can further filter the table by the following,

In [7]:
%%sql
select a.child as first, b.child as second
    from parents as a, parents as b
    where a.parent = b.parent;

 * sqlite://
Done.

[('barack', 'barack'),
 ('barack', 'clinton'),
 ('clinton', 'barack'),
 ('clinton', 'clinton'),
 ('herbert', 'herbert'),
 ('fillmore', 'fillmore'),
 ('abraham', 'abraham'),
 ('abraham', 'delano'),
 ('abraham', 'grover'),
 ('delano', 'abraham'),
 ('delano', 'delano'),
 ('delano', 'grover'),
 ('grover', 'abraham'),
 ('grover', 'delano'),
 ('grover', 'grover')]

We're quite close! The problem with the result above is that there are rows where the `first` and the `second` are the same, and there are rows that are duplicate of the other if we flip the values (e.g. one row is `abraham grover` and the other row is `grover abraham` . To solve this problem, we can filter it so that `a.child` has to be alphabetically either greater or less than `b.child`.

In [8]:
%%sql
select a.child as first, b.child as second
    from parents as a, parents as b
    where a.parent = b.parent and a.child < b.child;

 * sqlite://
Done.

[('barack', 'clinton'),
 ('abraham', 'delano'),
 ('abraham', 'grover'),
 ('delano', 'grover')]

Let's check if the result above is correct!

<img src = 'parent.png' width = 200/>

Indeed, `barack` and `clinton` are siblings. `abraham`, `delano` and `grover` are siblings on the same level as well. 

Whenever we want to join a table with itself, we'll need aliases and dot `.` expression to specify the desired rows.

## Joining Multiple Tables

Multiple tables can be joined to yield all possible combinations of rows from each table. 

Now let's create a new table called `grandparents`.

In [9]:
%%sql
create table grandparents as
    select a.parent as grandog, b.child as granpup
    from parents as a, parents as b
    where b.parent = a.child;

 * sqlite://
Done.

[]

In [11]:
%%sql
select * from grandparents;

 * sqlite://
Done.

[('eisenhower', 'abraham'),
 ('eisenhower', 'delano'),
 ('eisenhower', 'grover'),
 ('fillmore', 'barack'),
 ('fillmore', 'clinton'),
 ('fillmore', 'herbert')]

Looking at the tree structure, this table indicates the relationship between a grandparent and a grandchild. 

Now what if we want to select all grandparents that have the same fur as their grandchildren? Which tables need to be joined together? 

The answer should contain `fillmore` (since its grandchildren, `herbert`, also has a `"curly"` fur) and `eisenhower` (its grandchildren, `grover`, also has a `"short"` fur).

In [20]:
%%sql
select grandog from grandparents, dogs as c, dogs as d
    where grandog = c.name and granpup = d.name and c.fur = d.fur;

 * sqlite://
Done.

[('eisenhower',), ('fillmore',)]

At first, the cell above might seems confusing. We might think, "if both `grandog` and `granpup` uses the `name` column from `dogs`, why would we need to separate `dogs` using aliases `c` and `d`?

The aliases step is necessary so that we can filter our output so that the fur of the `grandog` is the same as the fur of the `granpup`. If we use the same `dogs` table for both `grandog` and `granpup`, we wouldn't be able to filter them out by their fur.

In [22]:
%%sql
seelct grandog from grandparents, dogs as c
where grandog = c.name and granpup = c.name;

 * sqlite://
(sqlite3.OperationalError) near "seelct": syntax error
[SQL: seelct grandog from grandparents, dogs as c
where grandog = c.name and granpup = c.name;]
(Background on this error at: http://sqlalche.me/e/e3q8)

As we can see above, we couldn't even use the same column twice.